// Номер автомобиля - четырехзначное число. Делится на 2, на 7 и на 11,
// в записи только две разные цифры, сумма цифр = 30.
#include <stdio.h>

int main()
{
    int n, a, b, c, d;
    n = 999;
    a = 0;
    b = 0;
    c = 0;
    d = 0;

    while (n < 10000)
    {
        n++;
        if (n % 2 == 0 && n % 7 == 0 && n % 11 == 0)
        {
            a = (n - n % 1000) / 1000;
            b = (n - a * 1000) / 100;
            c = (n - a * 1000 - b * 100) / 10;
            d = n - a * 1000 - b *100 - c * 10;

            // восставлено ||, потерянное при пересылке
            if ( ( (a == b || a == c || a == d) && (c == b || c == d) ) && (a + b + c + d == 30) ) printf("Nomer avto = %d%d%d%d\n", a, b, c, d);
        }
    }

    return 0;
}
